# brew
brew "openjdk@8"
brew "fzf"
brew "jq"
brew "kotlin-lsp" # Kotlin LSP (Claude Code kotlin-lsp plugin 用)

# tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jetbrains/utils"

# cask
cask "google-chrome"
cask "bettertouchtool"
cask "iterm2"
cask "visual-studio-code"
cask "zoom"
cask "slack"
cask "dbeaver-community"
cask "meetingbar"
cask "sketch"
cask "devtoys"
cask "notion"
cask "karabiner-elements"
